FemDesign.AuxiliaryResults.LabelledSection
Labelled section. Used for extracting detailed results along a section line or polyline.

FemDesign.AuxiliaryResults.LabelledSection.Verticies
The verticies of the labelled section. 2 verticies for line geometry and 3 or more for polyline geometry.

FemDesign.AuxiliaryResults.LabelledSection.Name
Identifier

FemDesign.AuxiliaryResults.LabelledSection.#ctor
Parameterless contructor for serialization

FemDesign.AuxiliaryResults.LabelledSection.#ctor(System.Collections.Generic.List{FemDesign.Geometry.Point3d},System.String)
Construct a labelled section
verticies: Verticies
identifier: Identifier

FemDesign.AuxiliaryResults.LabelledSection.#ctor(System.String,FemDesign.Geometry.Point3d[])
